--- a/py_mypy/README.md
+++ b/py_mypy/README.md
@@ -25,23 +25,15 @@ This all has the effect of creating a build sub-graph parallel to our normal bui
 
 To take a simple example, let's say that we have a small build graph
 
-```dot
-digraph G {
-  data_models [label="py_library data_models"];
-  order_processing [label="py_library order_processing"];
-  inventory_management [label="py_library inventory_management"];
-  data_persistence [label="py_library data_persistence"];
-  click [label="py_library click (3rdparty)"];
-  cli [label="py_binary cli"];
-
-  data_models -> order_processing;
-  data_models -> inventory_management;
-  inventory_management -> data_persistence;
-  order_processing -> data_persistence;
-  order_processing -> cli;
-  data_persistence -> cli;
-  click -> cli;
-}
+```mermaid
+graph TD
+    A[py_library data_models] --> B[py_library order_processing];
+    A --> C[py_library inventory_management];
+    C --> D[py_library data_persistence];
+    B --> D;
+    B --> E[py_binary cli];
+    D --> E;
+    F[py_library click (3rdparty)] --> E;
 ```
 
 Ordinarily the dependencies between these rules take the form of the Python source files underlying the rules.
